Revit 2027 API
Camera.TargetDistance Property
 Distance from camera to its target
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TargetDistance { get; set; }
Public Property TargetDistance As Double
	Get
	Set
public:
property double TargetDistance {
	double get ();
	void set (double value);
}
member TargetDistance : float with get, set
Property Value
Double
See Also
Reference
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace